# Generic: Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Generic: Fonts
cask "font-awesome-terminal-fonts"          # Fancy terminal font
cask "font-fira-code"                       # Fira Code: free monospaced font with programming ligatures

# Dev essentials
brew "git"                                  # Git version control tool
cask "docker"                               # Docker container tools
cask "iterm2"                               # Terminal Window app
cask "visual-studio-code"                   # Visual Studio Code 
brew "node"                                 # Nodejs language tools 
brew "nvm"                                  # Node Version Manager
brew "openjdk"                              # Open-source implementation of the Java platform

# Browsers
cask "google-chrome"                        # Google Chrome browser
cask "firefox"                              # Firefox browser

# Cloud storage
cask "google-backup-and-sync"               # Google backup and sync client
# cask "dropbox"                            # Dropbox client

# Entertainment
cask "yt-music"                             # YouTube Music: in-official Mac app
cask "spotify"                              # Spotify music service
cask "plex-media-server"                    # Plex media server
cask "plex"                                 # Plex client app
cask "vlc"                                  # Play-everything media player

# Social
cask "telegram"                             # Telegram messaging app
cask "whatsapp"                             # WhatsApp messageing app
cask "slack"                                # Slack messaging app
cask "skype"                                # Skype video call app

# Important tools
cask "bitwarden"                            # Password manager
cask "teamviewer"                           # Remote access tool
cask "cyberduck"                            # FTP client
cask "caffeine"                             # Prevent sleep mode and screen saver

# Someday tools
cask "mactex"                               # Free redistribution of TeX Live
cask "audacity"                             # Open-source digital audio editor
cask "sublime-text"                         # Cross-platform source code editor
brew "mkvtoolnix"                           # Collection of tools for .mkv files
cask "kap"                                  # Screen capture animated gifs

# Mac App Store
brew "mas"                                  # Mac App Store command-line interface
mas "Magnet", id: 441258766                 # OS tool to organize workspace
