# Generic: Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Generic: Fonts
cask "font-awesome-terminal-fonts"          # Fancy terminal font
cask "font-fira-code"                       # Fira Code: free monospaced font with programming ligatures

# Dev essentials
brew "git"                                  # Git version control tool
cask "github"                               # Notion app
cask "docker"                               # Docker container tools
cask "iterm2"                               # Terminal Window app
cask "insomnia"                             # Request testing tool
cask "visual-studio-code"                   # Visual Studio Code 
brew "node"                                 # Nodejs language tools 
brew "nvm"                                  # Node Version Manager
brew "yarn"                                 # Dependency manager
brew "gnupg"                                # GNU Pretty Good Privacy (PGP) package

# Oh My Zsh plugins
cask "zsh-autosuggestions"                  # Fish-like fast/unobtrusive autosuggestions for zsh
cask "zsh-syntax-highlighting"              # Fish shell-like syntax highlighting for Zsh

# Dev optionals
brew "openjdk"                              # Open-source implementation of the Java platform
cask "cyberduck"                            # FTP client

# Browsers
cask "google-chrome"                        # Google Chrome browser
cask "firefox"                              # Firefox browser

# Cloud storage
cask "google-backup-and-sync"               # Google backup and sync client
# cask "dropbox"                            # Dropbox client

# Productivity
cask "notion"                               # Notion app
cask "deepl"                                # Translater
cask "bitwarden"                            # Password manager
cask "caffeine"                             # Prevent sleep mode and screen saver
cask "teamviewer"                           # Remote access tool

# Entertainment
cask "yt-music"                             # YouTube Music: in-official Mac app
cask "sonos"                                # Sonos music app
cask "spotify"                              # Spotify music service
cask "vlc"                                  # Play-everything media player
cask "plex"                                 # Plex client app
# cask "plex-media-server"                  # Plex media server

# Home Automation
cask "home-assistant"                       # Home Assistant Companion app
brew "syncthing"                            # Continuous file synchronization

# Social
cask "telegram"                             # Telegram messaging app
cask "whatsapp"                             # WhatsApp messageing app
cask "slack"                                # Slack messaging app
cask "zoom"                                 # Zoom video calling
# cask "discord"                            # Discord messaging app
# cask "skype"                              # Skype video call app

# Someday tools
cask "mactex"                               # Free redistribution of TeX Live
cask "audacity"                             # Open-source digital audio editor
cask "sublime-text"                         # Cross-platform source code editor
brew "mkvtoolnix"                           # Collection of tools for .mkv files
cask "kap"                                  # Screen capture animated gifs

# Mac App Store
brew "mas"                                  # Mac App Store command-line interface
mas "Magnet", id: 441258766                 # OS tool to organize workspace
mas "We Love Lights", id: 1479422551        # We Love Lights for Phillips Hue
