# Generic: Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Generic: Monospace fonts
cask "font-awesome-terminal-fonts"
cask "font-fira-code"

# Dev essentials
brew "git"
cask "docker"
cask "iterm2"
cask "visual-studio-code"
brew "node"
brew "nvm"
brew "openjdk"

# Browsers
cask "google-chrome"
cask "firefox"

# Cloud storage
cask "dropbox"
cask "google-backup-and-sync"

# Entertainment
cask "yt-music"
cask "spotify"
cask "plex-media-server"
cask "plex"
cask "vlc"

# Social
cask "telegram"
cask "whatsapp"
cask "slack"
cask "skype"

# Important tools
cask "bitwarden"
cask "teamviewer"
cask "cyberduck"

# Someday tools
cask "mactex"
cask "audacity"
cask "sublime-text"
brew "mkvtoolnix"
cask "kap"                                  # Screen capture animated gifs
brew "mas" #Mac App Store command-line interface

# Mac App Store
mas "Magnet", id: 441258766
